AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена0</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УчетныеЗаписиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВнутреннихКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСериям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(удалить, заменен на ТипНоменклатуры)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОтгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппыДляКонструктора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТелеграм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИзАссортимента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SKU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/StockAPI_Остатки/Ext/Module.bsl
// Остатки StockAPI: обработчик GET /balances, запросы к ОстаткиТовара, серии из приходных.
// Зависимости: StockAPI_Утилиты, StockAPI_Цены, StockAPI_Справочники

// ─── Точка входа ─────────────────────────────────────────────────────────────

// Главная логика GET /balances.
// Возвращает Структура("КодОтвета, Тело") — Module.bsl преобразует в HTTP-ответ.
Функция ПолучитьОстатки(Запрос, КонтекстАвторизации) Экспорт
	
	Пагинация = StockAPI_Утилиты.ПараметрыПагинацииОстатков(Запрос);
	Если Пагинация.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", Пагинация.Ошибка));
	КонецЕсли;
	
	ФильтрСклад = РазрешенныйСкладИзЗапроса(Запрос, КонтекстАвторизации.УчетнаяЗапись);
	Если ФильтрСклад.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", ФильтрСклад.Ошибка));
	КонецЕсли;
	
	ФильтрВидЦены = ВидЦеныИзЗапроса(Запрос); 
	Если ФильтрВидЦены.Ошибка <> "" Тогда
		Возврат Новый Структура("КодОтвета, Тело", 400, Новый Структура("error", ФильтрВидЦены.Ошибка));
	КонецЕсли;
	
	ТаблицаОстатков = ТаблицаОстатков(ФильтрСклад.Склады, ФильтрВидЦены.ВидЦены);
	ВсегоНоменклатуры = ТаблицаОстатков.Количество();   
	РазмерСтраницы = Пагинация.pageSize;
	ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоНоменклатуры, РазмерСтраницы);
	Пропустить = (Пагинация.page - 1) * РазмерСтраницы;
	
	РезультатВидЦены = ФильтрВидЦены.ВидЦены.Наименование;
	РезультатВалюта = ФильтрВидЦены.ВидЦены.Валюта.Наименование;
	
	МассивСтрок = Новый Массив;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ТЗ", ТаблицаОстатков);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЗ.Номенклатура КАК Номенклатура,
	             |	ТЗ.Склад КАК Склад,
	             |	ТЗ.Остаток КАК Остаток,
	             |	ТЗ.Резерв КАК Резерв,
	             |	ТЗ.Цена0 КАК Цена0,
	             |	ТЗ.Цена1 КАК Цена1,
	             |	ТЗ.Цена2 КАК Цена2,
	             |	ТЗ.Цена3 КАК Цена3,
	             |	ТЗ.Порог1 КАК Порог1,
	             |	ТЗ.Порог2 КАК Порог2,
	             |	ТЗ.Порог3 КАК Порог3,
	             |	ТЗ.РазрешитьПродажу КАК РазрешитьПродажу
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	&ТЗ КАК ТЗ
	             |;
	             |
				|ВЫБРАТЬ ПЕРВЫЕ " + РазмерСтраницы + ?(Пропустить > 0, " ПРОПУСТИТЬ " + Пропустить, "") + "
	            //|ВЫБРАТЬ
	             |	ВТ.Номенклатура.Код КАК КодНоменклатуры,
	             |	ВТ.Номенклатура.Наименование КАК Номенклатура,
	             |	ВТ.Номенклатура.SKU КАК SKU,
	             |	ВТ.Номенклатура.Производитель.Наименование КАК Производитель,
	             |	ВТ.Склад.Код КАК Склад,
	             |	ВТ.Остаток КАК Остаток,
	             |	ВТ.Резерв КАК Резерв,
	             |	isnull(ВТ.Цена0,0) КАК Цена0,
	             |	isnull(ВТ.Цена1,0) КАК Цена1,
	             |	isnull(ВТ.Цена2,0) КАК Цена2,
	             |	isnull(ВТ.Цена3,0) КАК Цена3,
	             |	isnull(ВТ.Порог1,0) КАК Порог1,
	             |	isnull(ВТ.Порог2,0) КАК Порог2,
	             |	isnull(ВТ.Порог3,0) КАК Порог3,
	             |	isnull(ВТ.РазрешитьПродажу,0) КАК РазрешитьПродажу
	             |ИЗ
	             |	ВТ КАК ВТ
				 |УПОРЯДОЧИТЬ ПО 
				 |	ВТ.Склад,
				 |	ВТ.Номенклатура";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элемент = Новый Структура;
		Элемент.Вставить("priceType", 	РезультатВидЦены);
		Элемент.Вставить("currency",	РезультатВалюта);
		Элемент.Вставить("warehouse", 	Выборка.Склад);
		Элемент.Вставить("item", 		Выборка.Номенклатура);
		Элемент.Вставить("itemCode", 	StockAPI_Утилиты.КодВСтроку(Выборка.КодНоменклатуры));
		Элемент.Вставить("itemSku", 	Выборка.SKU);
		Элемент.Вставить("manufacturer",Строка(Выборка.Производитель));
		Элемент.Вставить("balance",		Выборка.Остаток);
		Элемент.Вставить("reserve", 	Выборка.Резерв); 
		мас = Новый Массив; 
		мас.Добавить(Новый Структура("priceQty,qty", Выборка.Цена0, 0));
		Для Порог = 1 По 3 Цикл
			Если Выборка["Цена" + Порог] > 0 Тогда
				мас.Добавить(Новый Структура("priceQty,qty", Выборка["Цена"+Порог], Выборка["Порог"+Порог]));
			КонецЕсли;
		КонецЦикла; 
		Элемент.Вставить("price",		мас);
		//Элемент.Вставить("allow",		Выборка.РазрешитьПродажу);
		МассивСтрок.Добавить(Элемент);
	КонецЦикла;
	
	ТелоОтвета = Новый Структура;
	ТелоОтвета.Вставить("page", 		Пагинация.page);
	ТелоОтвета.Вставить("pageSize", 	РазмерСтраницы);
	ТелоОтвета.Вставить("totalItems", 	ВсегоНоменклатуры);
	ТелоОтвета.Вставить("totalPages", 	ВсегоСтраниц);
	ТелоОтвета.Вставить("items", 		МассивСтрок);
	
	//Если ЗначениеЗаполнено(ФильтрСклады.warehouseId) Тогда
	//	ТелоОтвета.Вставить("warehouse", 		ФильтрСклад.Склад.Наименование);
	//	ТелоОтвета.Вставить("warehouseCode", 	ФильтрСклад.warehouseCode);
	//КонецЕсли;
	
	Возврат Новый Структура("КодОтвета, Тело", 200, ТелоОтвета);

	//========================================	
	
	
	
	
	
	
	
	
	
	//ВсегоНоменклатуры = КоличествоНоменклатурыНаОстатках(ФильтрСклады.Склад);
	//ВсегоСтраниц = StockAPI_Утилиты.ВсегоСтраницПагинации(ВсегоНоменклатуры, Пагинация.pageSize);
	//Пропустить = (Пагинация.page - 1) * Пагинация.pageSize;
	//НоменклатураСтраницы = НоменклатураНаОстаткахСтраница(Пагинация.pageSize, Пропустить, ФильтрСклады.Склад);
	//
	//Таблица = ТаблицаОстатковПоНоменклатуре(НоменклатураСтраницы, ФильтрСклады.Склад);
	//
	//МассивНоменклатуры = StockAPI_Цены.УникальнаяНоменклатураИзТаблицы(Таблица);
	//ЦеныПоНоменклатуре = StockAPI_Цены.ЗагрузитьЦеныПродажиВсехВидов(МассивНоменклатуры);
	//
	//Группы = Новый Соответствие;
	//
	//Для Каждого Стр Из Таблица Цикл
	//	
	//	//Если ССериями Тогда
	//	//	Ключ = КлючГруппыОстатков(Стр.warehouse, Стр.itemCode, Стр.batch);
	//	//Иначе
	//		Ключ = КлючГруппыОстатковСводно(Стр.warehouse, Стр.itemCode);
	//	//КонецЕсли;
	//	Элемент = Группы.Получить(Ключ);
	//	
	//	Если Элемент = Неопределено Тогда
	//		Элемент = Новый Структура;
	//		Элемент.Вставить("warehouse", Строка(Стр.warehouse));
	//		Элемент.Вставить("item", Строка(Стр.item));
	//		Элемент.Вставить("itemCode", Строка(Стр.itemCode));
	//		//Элемент.Вставить("sku", Строка(Стр.sku));
	//		//Элемент.Вставить("itemType", Строка(Стр.itemType));
	//		Элемент.Вставить("manufacturer", Строка(Стр.manufacturer));
	//		//Если ССериями Тогда
	//		//	Элемент.Вставить("batch", Строка(Стр.batch));
	//		//	Элемент.Вставить("serials", Новый Массив);
	//		//	Элемент.Вставить("units", Новый Массив);
	//		//КонецЕсли;
	//		Элемент.Вставить("qty", 0);
	//		Элемент.Вставить("reserve", 0);
	//		Элемент.Вставить("Номенклатура", Стр.Номенклатура);
	//		Группы.Вставить(Ключ, Элемент);
	//	КонецЕсли;
	//	
	//	Элемент.qty = Элемент.qty + Стр.qty;
	//	Элемент.reserve = Элемент.reserve + Стр.reserve;
	//	
	//	//Если ССериями Тогда
	//	//	
	//	//	Серия = СокрЛП(Стр.serialParty);
	//	//	Если Серия = "" Тогда
	//	//		МассивСерийПартии = СерииПоПартиям.Получить(Стр.Партия);
	//	//		Если МассивСерийПартии <> Неопределено И МассивСерийПартии.Количество() > 0 Тогда
	//	//			Серия = МассивСерийПартии[0];
	//	//		КонецЕсли;
	//	//	КонецЕсли;
	//	//	
	//	//	Единица = Новый Структура;
	//	//	Единица.Вставить("batchCode", Строка(Стр.batchCode));
	//	//	//Единица.Вставить("sku", Строка(Стр.sku));
	//	//	//Единица.Вставить("itemType", Строка(Стр.itemType));
	//	//	Единица.Вставить("manufacturer", Строка(Стр.manufacturer));
	//	//	Единица.Вставить("serial", Серия);
	//	//	Единица.Вставить("qty", Стр.qty);
	//	//	Элемент.units.Добавить(Единица);
	//	//	
	//	//	ДобавитьСерийникВМассив(Элемент.serials, Серия);
	//	//	
	//	//КонецЕсли;
	//	
	//КонецЦикла;
	//
	////Если ССериями Тогда
	////	Для Каждого КлючИЗначение Из Группы Цикл
	////		Элемент = КлючИЗначение.Значение;
	////		МассивДоп = СерииПоГруппе.Получить(КлючИЗначение.Ключ);
	////		Если МассивДоп <> Неопределено Тогда
	////			Для Каждого Серия Из МассивДоп Цикл
	////				ДобавитьСерийникВМассив(Элемент.serials, Серия);
	////			КонецЦикла;
	////		КонецЕсли;
	////	КонецЦикла;
	////КонецЕсли;
	//
	//Для Каждого КлючИЗначение Из Группы Цикл
	//	Элемент = КлючИЗначение.Значение;
	//	ЦеныНоменклатуры = ЦеныПоНоменклатуре.Получить(Элемент.Номенклатура);
	//	StockAPI_Цены.ДобавитьЦеныВСтруктуру(Элемент, ЦеныНоменклатуры, Элемент.qty, ВидЦены);
	//	//Если ССериями Тогда
	//	//	Для Каждого Единица Из Элемент.units Цикл
	//	//		StockAPI_Цены.ДобавитьЦеныВСтруктуру(Единица, ЦеныНоменклатуры, Единица.qty, ВидЦены);
	//	//	КонецЦикла;
	//	//КонецЕсли;
	//	Элемент.Удалить("Номенклатура");
	//КонецЦикла;
	//
	//МассивСтрок = Новый Массив;
	//Для Каждого КлючИЗначение Из Группы Цикл
	//	МассивСтрок.Добавить(КлючИЗначение.Значение);
	//КонецЦикла;
	//
	//ТелоОтвета = Новый Структура;
	//ТелоОтвета.Вставить("page", Пагинация.page);
	//ТелоОтвета.Вставить("pageSize", Пагинация.pageSize);
	//ТелоОтвета.Вставить("totalItems", ВсегоНоменклатуры);
	//ТелоОтвета.Вставить("totalPages", ВсегоСтраниц);
	//ТелоОтвета.Вставить("items", МассивСтрок);
	//Если ЗначениеЗаполнено(ФильтрСклады.Склад) Тогда
	//	ТелоОтвета.Вставить("warehouse", Строка(ФильтрСклады.Склад));
	//	ТелоОтвета.Вставить("warehouseCode", ФильтрСклады.warehouseCode);
	//КонецЕсли;
	//
	//Возврат Новый Структура("КодОтвета, Тело", 200, ТелоОтвета);
	
КонецФункции

Функция ТаблицаОстатков(Склады, ВидЦены)

	запр = Новый Запрос;
	запр.УстановитьПараметр("Склады",	Склады);
	запр.УстановитьПараметр("ВидЦены",	ВидЦены);
    запр.Текст = "ВЫБРАТЬ
                 |	ОстаткиТовара.Номенклатура КАК Номенклатура,
                 |	ОстаткиТовара.Склад КАК Склад,
                 |	ОстаткиТовара.ОстатокОстаток КАК Остаток,
                 |	ОстаткиТовара.РезервОстаток КАК Резерв,
                 |	ЦеныПродажи.Цена0 КАК Цена0,
                 |	ЦеныПродажи.Цена1 КАК Цена1,
                 |	ЦеныПродажи.Цена2 КАК Цена2,
                 |	ЦеныПродажи.Цена3 КАК Цена3,
                 |	ЦеныПродажи.Порог1 КАК Порог1,
                 |	ЦеныПродажи.Порог2 КАК Порог2,
                 |	ЦеныПродажи.Порог3 КАК Порог3,
                 |	ЦеныПродажи.РазрешитьПродажу КАК РазрешитьПродажу
                 |ИЗ
                 |	РегистрНакопления.ОстаткиТовара.Остатки(, Склад В (&Склады)) КАК ОстаткиТовара
                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажи.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныПродажи
                 |		ПО ОстаткиТовара.Склад = ЦеныПродажи.Склад
                 |			И ОстаткиТовара.Номенклатура = ЦеныПродажи.Номенклатура
                 |ГДЕ
                 |	ОстаткиТовара.ОстатокОстаток > 0
                 |	И НЕ ОстаткиТовара.Номенклатура.ЗапретОтгрузки
                 |	И ОстаткиТовара.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
                 |
                 |УПОРЯДОЧИТЬ ПО
                 |	Склад,
                 |	Номенклатура";
	Выгрузка = Запр.Выполнить().Выгрузить();
	Возврат Выгрузка;
	
КонецФункции // ТаблицаОстатков()


// ─── Фильтр и пагинация ───────────────────────────────────────────────────────

Функция ВидЦеныИзЗапроса(Запрос)

	Результат = Новый Структура("ВидЦены, Ошибка", Неопределено, "");

	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("priceType");
	Если ПараметрКода = Неопределено Тогда
		Результат.Ошибка = "Параметр priceType не найден.";
		Возврат Результат;
	КонецЕсли;
	
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(ПараметрКода, Истина);
	Если ВидЦены = Справочники.ВидыЦен.ПустаяСсылка() Тогда
		Результат.Ошибка = СтрШаблон("Не найден вид цены %1.", ПараметрКода);
	Иначе
	    Результат.ВидЦены = ВидЦены;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ВидЦеныизЗапроса()


// Фильтр по складу: warehouseId, warehouseCode или code (числовой код из /warehouses). 
// Если код задан, возвращает склад по коду из перечня разрешенных
// Если код не задан, возвращает массив разрешенных складов
//
Функция РазрешенныйСкладИзЗапроса(Запрос, УчетаяЗапись)
	
	Результат = Новый Структура("Склады, Ошибка", Неопределено, "");
	
	ПараметрКода = Запрос.ПараметрыЗапроса.Получить("warehouseId");
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("warehouseCode");
	КонецЕсли;
	Если ПараметрКода = Неопределено Тогда
		ПараметрКода = Запрос.ПараметрыЗапроса.Получить("code");
	КонецЕсли;
	Если ПараметрКода = Неопределено Тогда  
		КодЧисло = Неопределено;
	Иначе	
		Попытка
			КодЧисло = Число(СокрЛП(Строка(ПараметрКода)));
			//Результат.warehouseId = Строка(ПараметрКода);
		Исключение
			Результат.Ошибка = "Параметр warehouseId (или warehouseCode) должен быть числовым кодом склада.";
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;
	
	Запр = Новый Запрос;  
	Запр.УстановитьПараметр("УчетаяЗапись",	УчетаяЗапись);
	Запр.УстановитьПараметр("Код",			КодЧисло);
	Запр.Текст = "ВЫБРАТЬ
	             |	Склады.Склад КАК Склад
	             |ИЗ
	             |	Справочник.УчетныеЗаписиИнтеграции.Склады КАК Склады
	             |ГДЕ
	             |	Склады.Ссылка = &УчетаяЗапись
	             |	И НЕ Склады.Склад.ПометкаУдаления
	             |	И ВЫБОР
	             |			КОГДА &Код = НЕОПРЕДЕЛЕНО
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ Склады.Склад.Код = &Код
	             |		КОНЕЦ"; 
	РезультатЗапроса = Запр.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Ошибка = "Нет доступа к указанному складу.";
	Иначе	
		Результат.Склады = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Склад");
	КонецЕсли;  
	
 	Возврат Результат;
	
	//Склад = Справочники.Склады.НайтиПоКоду(КодЧисло);
	//Если НЕ ЗначениеЗаполнено(Склад) Или Склад.ПометкаУдаления Тогда
	//	Результат.Ошибка = СтрШаблон("Склад с кодом %1 не найден.", СтрокаКода);
	//	Возврат Результат;
	//КонецЕсли;
	//
	//МассивДоступных = омСервер.МассивСкладов();
	//Если МассивДоступных.Количество() > 0 Тогда
	//	Доступен = Ложь;
	//	Для Каждого ДоступныйСклад Из МассивДоступных Цикл
	//		Если ДоступныйСклад = Склад Тогда
	//			Доступен = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если НЕ Доступен Тогда
	//		Результат.Ошибка = "Нет доступа к указанному складу.";
	//		Возврат Результат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Результат.Склад = Склад;
	//Результат.warehouseCode = StockAPI_Справочники.КодВСтроку(КодЧисло);
	//Возврат Результат;
	
КонецФункции

// ─── Запросы к РН ОстаткиТовара ──────────────────────────────────────────────

Функция КоличествоНоменклатурыНаОстатках(Склад = Неопределено)
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ост.Номенклатура) КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(, ) КАК Ост
	|ГДЕ
	|	Ост.ОстатокОстаток > 0
	|{ГДЕ
	|	(Ост.Склад = &Склад)}";
	Зап.УстановитьПараметр("Склад", Склад);
	
	Выборка = Зап.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция НоменклатураНаОстаткахСтраница(РазмерСтраницы, Пропустить, Склад = Неопределено)
	
	МассивНоменклатуры = Новый Массив;
	
	Если РазмерСтраницы <= 0 Тогда
		Возврат МассивНоменклатуры;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ " + РазмерСтраницы + ?(Пропустить > 0, " ПРОПУСТИТЬ " + Пропустить, "") + "
	|	Вложенный.Номенклатура КАК Номенклатура
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Ост.Номенклатура КАК Номенклатура,
	|		Ост.Номенклатура.Код КАК КодСортировки,
	|		Ост.Номенклатура.Наименование КАК НаименованиеСортировки
	|	ИЗ
	|		РегистрНакопления.ОстаткиТовара.Остатки(, ) КАК Ост
	|	ГДЕ
	|		Ост.ОстатокОстаток > 0
	|		И Ост.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	{ГДЕ
	|		(Ост.Склад = &Склад)}) КАК Вложенный
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вложенный.КодСортировки,
	|	Вложенный.НаименованиеСортировки";
	Зап.УстановитьПараметр("Склад", Склад);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

Функция ТаблицаОстатковПоНоменклатуре(НоменклатураСтраницы, Склад = Неопределено)
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("warehouse");
	ПустаяТаблица.Колонки.Добавить("Склад");
	ПустаяТаблица.Колонки.Добавить("item");
	ПустаяТаблица.Колонки.Добавить("itemCode");
	//ПустаяТаблица.Колонки.Добавить("sku");
	//ПустаяТаблица.Колонки.Добавить("itemType");
	ПустаяТаблица.Колонки.Добавить("manufacturer");
	ПустаяТаблица.Колонки.Добавить("Номенклатура");
	//ПустаяТаблица.Колонки.Добавить("batch");
	//ПустаяТаблица.Колонки.Добавить("batchCode");
	//ПустаяТаблица.Колонки.Добавить("serialParty");
	//ПустаяТаблица.Колонки.Добавить("Партия");
	ПустаяТаблица.Колонки.Добавить("qty", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("reserve", Новый ОписаниеТипов("Число"));
	
	Если НоменклатураСтраницы.Количество() = 0 Тогда
		Возврат ПустаяТаблица;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст =
	"ВЫБРАТЬ
	|	Ост.Склад.Наименование КАК warehouse,
	|	Ост.Склад КАК Склад,
	|	Ост.Номенклатура.Наименование КАК item,
	|	Ост.Номенклатура.Код КАК itemCode,
	//|	Ост.Номенклатура.ВидНоменклатуры.Наименование КАК itemType,
	|	Ост.Номенклатура.Производитель.Наименование КАК manufacturer,
	|	Ост.Номенклатура КАК Номенклатура,
	//|	Ост.Партия.Наименование КАК batch,
	//|	Ост.Партия.Код КАК batchCode,
	//|	Ост.Партия.Серия КАК serialParty,
	//|	Ост.Партия КАК Партия,
	|	Ост.ОстатокОстаток КАК qty,
	|	Ост.РезервОстаток КАК reserve
	|ИЗ
	|	РегистрНакопления.ОстаткиТовара.Остатки(, ) КАК Ост
	|ГДЕ
	|	Ост.ОстатокОстаток > 0
	|	И Ост.Номенклатура В(&Номенклатура)
	|{ГДЕ
	|		(Ост.Склад = &Склад)}";
	Зап.УстановитьПараметр("Номенклатура", НоменклатураСтраницы);
	Зап.УстановитьПараметр("Склад", Склад);
	
	Возврат Зап.Выполнить().Выгрузить();
	
КонецФункции

Функция КлючГруппыОстатков(Склад, КодТовара, Партия)
	Возврат Строка(Склад) + "|" + Строка(КодТовара) + "|" + Строка(Партия);
КонецФункции

Функция КлючГруппыОстатковСводно(Склад, КодТовара)
	Возврат Строка(Склад) + "|" + Строка(КодТовара);
КонецФункции

// ─── Серийные номера из приходных накладных ───────────────────────────────────

//Процедура ДобавитьСерийникВМассив(МассивСерий, ЗначениеСерии)
//	
//	Серия = СокрЛП(ЗначениеСерии);
//	Если Серия = "" Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Для Каждого Существующая Из МассивСерий Цикл
//		Если Существующая = Серия Тогда
//			Возврат;
//		КонецЕсли;
//	КонецЦикла;
//	
//	МассивСерий.Добавить(Серия);
//	
//КонецПроцедуры

//// Серии по партиям из строк приходных накладных.
//// Возвращает Соответствие: Партия → [Серия, ...].
//Функция СерииИзСтрокПриходных(ТаблицаОстатков)
//	
//	Результат = Новый Соответствие;
//	МассивПартий = Новый Массив;
//	
//	Для Каждого Стр Из ТаблицаОстатков Цикл
//		Если ЗначениеЗаполнено(Стр.Партия) Тогда
//			МассивПартий.Добавить(Стр.Партия);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Если МассивПартий.Количество() = 0 Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	Зап = Новый Запрос;
//	Зап.Текст =
//	"ВЫБРАТЬ
//	|	Товары.Партия КАК Партия,
//	|	Товары.Серия КАК Серия
//	|ИЗ
//	|	Документ.ПриходнаяНакладная.Товары КАК Товары
//	|ГДЕ
//	|	Товары.Партия В (&Партии)
//	|	И Товары.Серия <> """"
//	|	И Товары.Ссылка.Проведен";
//	Зап.УстановитьПараметр("Партии", МассивПартий);
//	
//	Выборка = Зап.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		МассивСерий = Результат.Получить(Выборка.Партия);
//		Если МассивСерий = Неопределено Тогда
//			МассивСерий = Новый Массив;
//			Результат.Вставить(Выборка.Партия, МассивСерий);
//		КонецЕсли;
//		ДобавитьСерийникВМассив(МассивСерий, Выборка.Серия);
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

//// Серии сгруппированные по ключу (склад|код_товара|партия) из приходных накладных.
//// Возвращает Соответствие: КлючГруппы → [Серия, ...].
//Функция СерииИзСтрокПриходныхПоГруппе(ДатаОстатков, НоменклатураСтраницы = Неопределено, Склад = Неопределено)
//	
//	Результат = Новый Соответствие;
//	
//	Если НоменклатураСтраницы <> Неопределено И НоменклатураСтраницы.Количество() = 0 Тогда
//		Возврат Результат;
//	КонецЕсли;
//	
//	Зап = Новый Запрос;
//	ТекстЗапроса =
//	"ВЫБРАТЬ
//	|	Ост.Склад.Наименование КАК warehouse,
//	|	Ост.Номенклатура.Код КАК itemCode,
//	|	Ост.Партия.Наименование КАК batch,
//	|	Товары.Серия КАК Серия
//	|ИЗ
//	|	РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Ост
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Товары КАК Товары
//	|		ПО Ост.Партия = Товары.Партия
//	|ГДЕ
//	|	Ост.ОстатокОстаток > 0
//	|	И Товары.Серия <> """"
//	|	И Товары.Ссылка.Проведен
//	|	И (&БезСклада
//	|		ИЛИ Ост.Склад = &Склад)";
//	
//	Если НоменклатураСтраницы <> Неопределено Тогда
//		ТекстЗапроса = ТекстЗапроса + "
//	|	И Ост.Номенклатура В (&Номенклатура)";
//		Зап.УстановитьПараметр("Номенклатура", НоменклатураСтраницы);
//	КонецЕсли;
//	
//	Зап.Текст = ТекстЗапроса;
//	Зап.УстановитьПараметр("Дата", ДатаОстатков);
//	Зап.УстановитьПараметр("БезСклада", НЕ ЗначениеЗаполнено(Склад));
//	Зап.УстановитьПараметр("Склад", ?(ЗначениеЗаполнено(Склад), Склад, Справочники.Склады.ПустаяСсылка()));
//	
//	Выборка = Зап.Выполнить().Выбрать();
//	Пока Выборка.Следующий() Цикл
//		Ключ = КлючГруппыОстатков(Выборка.warehouse, Выборка.itemCode, Выборка.batch);
//		МассивСерий = Результат.Получить(Ключ);
//		Если МассивСерий = Неопределено Тогда
//			МассивСерий = Новый Массив;
//			Результат.Вставить(Ключ, МассивСерий);
//		КонецЕсли;
//		ДобавитьСерийникВМассив(МассивСерий, Выборка.Серия);
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции
